"The Unarchiver/Unarchive To Current Folder" = "The Unarchiver/Pak uit in dezelfde map";

"The Unarchiver/Unarchive To Desktop" = "The Unarchiver/Pak uit op bureaublad";

"The Unarchiver/Unarchive To..." = "The Unarchiver/Pak uit naar...";